app/controllers/notes_controller.rb

  def create
    @note = Note.new(note_params)

    if @note.save
---
INSERT INTO "notes" ("name", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "bbb"], ["content", "aaa"], ["created_at", "2018-10-25 16:30:19.394113"], ["updated_at", "2018-10-25 16:30:19.394113"]]

  def update
    if @note.update(note_params)
---
UPDATE "notes" SET "name" = ?, "content" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["name", "testing 123"], ["content", "abcasd"], ["updated_at", "2018-10-25 16:39:12.071236"], ["id", 23]]